In [1]:
pip install pandas

Requirement already satisfied: pandas in c:\users\sn137\appdata\roaming\python\python39\site-packages (2.2.2)
Requirement already satisfied: tzdata>=2022.7 in c:\users\sn137\appdata\roaming\python\python39\site-packages (from pandas) (2024.1)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\programdata\anaconda3\envs\cse\lib\site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in c:\programdata\anaconda3\envs\cse\lib\site-packages (from pandas) (2022.7)
Requirement already satisfied: numpy>=1.22.4 in c:\programdata\anaconda3\envs\cse\lib\site-packages (from pandas) (1.23.5)
Requirement already satisfied: six>=1.5 in c:\programdata\anaconda3\envs\cse\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)
Note: you may need to restart the kernel to use updated packages.

In [2]:
import pandas as pd

In [3]:
pd.__version__

'2.2.2'

In [4]:
pip install --upgrade pandas --user

Requirement already satisfied: pandas in c:\users\sn137\appdata\roaming\python\python39\site-packages (2.2.2)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\programdata\anaconda3\envs\cse\lib\site-packages (from pandas) (2.8.2)
Requirement already satisfied: numpy>=1.22.4 in c:\programdata\anaconda3\envs\cse\lib\site-packages (from pandas) (1.23.5)
Requirement already satisfied: pytz>=2020.1 in c:\programdata\anaconda3\envs\cse\lib\site-packages (from pandas) (2022.7)
Requirement already satisfied: tzdata>=2022.7 in c:\users\sn137\appdata\roaming\python\python39\site-packages (from pandas) (2024.1)
Requirement already satisfied: six>=1.5 in c:\programdata\anaconda3\envs\cse\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)
Note: you may need to restart the kernel to use updated packages.

In [5]:
s1=pd.Series(["Uthaya","122012012833","B.TECH-CSE-'A'","Software Developer"],index=['Name','Reg No','Dept','Proffesion'])

In [6]:
print(s1)

Name                      Uthaya
Reg No              122012012833
Dept              B.TECH-CSE-'A'
Proffesion    Software Developer
dtype: object

# DATA FRAME

variable_name=pd.DataFrame(data,column=[column name])

In [7]:
df1=pd.DataFrame(s1,columns=["Student Details"])

In [8]:
df1

               Student Details
Name                    Uthaya
Reg No            122012012833
Dept            B.TECH-CSE-'A'
Proffesion  Software Developer

In [9]:
s2=pd.Series(["B.Tech","SEC","with AI & ML","entrepreneur"],index=['Name','Reg No','Dept','Proffesion'])

In [10]:
print(s2)

Name                B.Tech
Reg No                 SEC
Dept          with AI & ML
Proffesion    entrepreneur
dtype: object

In [11]:
df2=pd.DataFrame(s2,columns=["Student Details"])

In [12]:
df2

           Student Details
Name                B.Tech
Reg No                 SEC
Dept          with AI & ML
Proffesion    entrepreneur

In [13]:
df1["Age"]=s2

In [14]:
df1

               Student Details           Age
Name                    Uthaya        B.Tech
Reg No            122012012833           SEC
Dept            B.TECH-CSE-'A'  with AI & ML
Proffesion  Software Developer  entrepreneur

In [15]:
Fruits={"seed":{1:"Orange",2:"Apple",3:"water melon"},"seedless":{1:"grape",2:"pineapple",3:"pappaya"}}

In [16]:
df2=pd.DataFrame(Fruits,columns=["seed","seedless"])

In [17]:
df2

          seed   seedless
1       Orange      grape
2        Apple  pineapple
3  water melon    pappaya

In [25]:
MobileShope={"samsung":{1:"samsung s23 ultra",2:"samsung galaxy"},"Apple":{1:"iphone 14 pro max",2:"iphone 16 pro max"}}

In [28]:
df2=pd.DataFrame(MobileShope,columns=["samsung","Apple"])

In [29]:
df2

             samsung              Apple
1  samsung s23 ultra  iphone 14 pro max
2     samsung galaxy  iphone 16 pro max

In [35]:
df2.drop("samsung",axis=1)

               Apple
1  iphone 14 pro max
2  iphone 16 pro max